[
  {
    "label": "Apple___Apple_scab",
    "readableName": "Apple with Scab",
    "symptoms": "- Circular spots are light brown and start to appear on fruit and leaves in early spring\n- Scabs are sunken, up to ¾” around, dark brown, and make spores in their center\n- Leaves and fruit are affected, often leaves around developing fruit, and at the blossom end of young fruit\n- Deformed, twisted leaves\n- Cracked skin on fruit\n- Young fruit that is infected often drops to the ground early\n- Mature fruit that was infected at harvest may develop apple scab in storage\n\n\nhttps://www.independenttree.com/apple-scab-identification-prevention-treatment-2/",
    "treatments": null,
    "preventiveMeasures": "- Choose scab-resistant varieties of apple or crabapple trees.\n- Rake up and discard any fallen leaves or fruit on a regular basis, and never leave fallen leaves or fruit on the ground over winter. Apple scab fungus overwinters on fallen leaves and fruit.\n- Prune your apple and crabapple trees to keep their crowns open so light and air can move through. Dry leaves and fruit help to prevent initial infection.\n- Plant your apple and crabapple trees correctly, in full sun and with enough space around each tree, according to their mature size. Shade keeps water from evaporating quickly, and crowded trees are more susceptible to the disease.\n- Irrigate your trees in the early morning hours, and don't use overhead sprays that will wet leaves and fruit. Dry leaves won't host the fungus.\n\n\nhttps://www.independenttree.com/apple-scab-identification-prevention-treatment-2/"
  },
  {
    "label": "Apple___Black_rot",
    "readableName": "Apple with Black Rot",
    "symptoms": "Early symptoms are often limited to leaf symptoms such as purple spots on upper leaf surfaces. As these spots age, the margins remain purple, but the centers dry out and turn yellow to brown. Overtime, the spots expand, and heavily infected leaves drop from the tree. Infected branches or limbs will show characteristic red-brown sunken areas that expand each year. Fruit infection is the most destructive form of this pathogen and begins with infected flowers before fruits expand. When fruits are tiny and green, you’ll notice red flecks or purplish pimples that enlarge as the fruit does. Mature fruit lesions take on a bulls-eye appearance, with bands of brown and black areas expanding outward from a central point in each lesion. Commonly, black rot disease causes blossom end rot or mummification of the fruits on the tree.\nhttps://www.gardeningknowhow.com/edible/fruits/apples/black-rot-on-apple-trees.htm",
    "treatments": "- Prune out dead or diseased branches.\n- Pick all dried and shriveled fruits remaining on the trees.\n- Remove infected plant material from the area.\n- All infected plant parts should be burned, buried or sent to a municipal composting site.\n- Be sure to remove the stumps of any apple trees you cut down. Dead stumps can be a source of spores.\n\nhttps://extension.umn.edu/plant-diseases/black-rot-apple",
    "preventiveMeasures": null
  },
  {
    "label": "Apple___Cedar_apple_rust",
    "readableName": "Apple with Cedar Apple Rust",
    "symptoms": "Cedar apple rust (Gymnosporangium juniperi-virginianae) is a fungal disease that requires juniper plants to complete its complicated two year life-cycle. Spores overwinter as a reddish-brown gall on young twigs of various juniper species. In early spring, during wet weather, these galls swell and bright orange masses of spores are blown by the wind where they infect susceptible apple and crab-apple trees. The spores that develop on these trees will only infect junipers the following year. From year to year, the disease must pass from junipers to apples to junipers again; it cannot spread between apple trees.\n\nOn apple and crab-apple trees, look for pale yellow pinhead sized spots on the upper surface of the leaves shortly after bloom. These gradually enlarge to bright orange-yellow spots which make the disease easy to identify. Orange spots may develop on the fruit as well. Heavily infected leaves may drop prematurely.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/cedar-apple-rust/",
    "treatments": "1. Choose resistant cultivars when available.\n2. Rake up and dispose of fallen leaves and other debris from under trees.\n3. Remove galls from infected junipers. In some cases, juniper plants should be removed entirely.\n4. Apply preventative, disease-fighting fungicides labeled for use on apples weekly, starting with bud break, to protect trees from spores being released by the juniper host. This occurs only once per year, so additional applications after this springtime spread are not necessary.\n5. On juniper, rust can be controlled by spraying plants with a copper solution (0.5 to 2.0 oz/ gallon of water) at least four times between late August and late October.\n6. Safely treat most fungal and bacterial diseases with SERENADE Garden. This broad spectrum bio-fungicide uses a patented strain of Bacillus subtilis that is registered for organic use. Best of all, SERENADE is completely non-toxic to honey bees and beneficial insects.\n7. Containing sulfur and pyrethrins, Bonide® Orchard Spray is a safe, one-hit concentrate for insect attacks and fungal problems. For best results, apply as a protective spray (2.5 oz/ gallon) early in the season. If disease, insects or wet weather are present, mix 5 oz in one gallon of water. Thoroughly spray all parts of the plant, especially new shoots.\n8. Contact your local Agricultural Extension office for other possible solutions in your area.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/cedar-apple-rust/",
    "preventiveMeasures": null
  },
  {
    "label": "Apple___healthy",
    "readableName": "Healthy Apple",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Blueberry___healthy",
    "readableName": "Healthy Blueberry",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Cherry_(including_sour)___healthy",
    "readableName": "Healthy Cherry (inc. sour)",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Cherry_(including_sour)___Powdery_mildew",
    "readableName": "Cherry (inc. sour) with Powdery Mildew",
    "symptoms": "Symptoms usually appear later in the growing season on outdoor plants. Powdery mildew starts on young leaves as raised blister-like areas that cause leaves to curl, exposing the lower leaf surface. Infected leaves become covered with a white to gray powdery growth, usually on the upper surface; unopened flower buds may be white with mildew and may never open. Leaves of severely infected plants turn brown and drop. The disease prefers young, succulent growth; mature leaves are usually not affected.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/powdery-mildew/",
    "treatments": "1. Plant resistant cultivars in sunny locations whenever possible.\n2. Prune or stake plants to improve air circulation. Make sure to disinfect your pruning tools (one part bleach to 4 parts water) after each cut.\n3. Remove diseased foliage from the plant and clean up fallen debris on the ground.\n4. Use a thick layer of mulch or organic compost to cover the soil after you have raked and cleaned it well. Mulch will prevent the disease spores rom splashing back up onto the leaves.\n5. Milk sprays, made with 40% milk and 60% water, are an effective home remedy for use on a wide range of plants. For best results, spray plant leaves as a preventative measure every 10-14 days.\n6. Wash foliage occasionally to disrupt the daily spore-releasing cycle. Neem oil and PM Wash, used on a 7 day schedule, will prevent fungal attack on plants grown indoors.\n7. Water in the morning, so plants have a chance to dry during the day. Drip irrigation and soaker hoses will help keep the foliage dry.\n8. Use a slow-release, organic fertilizer on crops and avoid excess nitrogen. Soft, leafy, new growth is most susceptible.\n9. Destroy all plant debris after harvest (see Fall Garden Cleanup). Do NOT compost.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/powdery-mildew/",
    "preventiveMeasures": null
  },
  {
    "label": "Corn_(maize)___Cercospora_leaf_spot Gray_leaf_spot",
    "readableName": "Corn (maize): Cercospora leaf spot Gray leaf spot",
    "symptoms": "Small necrotic (brown or tan) spots that may have a yellow chlorotic halo appear on lower leaves, usually before flowering. Gradually these lesions will turn grayish and appear on younger leaves, too. As the disease progresses, they enlarge into elongated, rectangular lesions that run parallel to the leaf veins. In optimal conditions (warm temperatures, high humidity and wet leaves), they can coalesce and engulf the whole leaf. If this happens before grain filling there can be considerable yield losses. The leaf blight can weaken the plants and sometimes soften the stalks, leading to lodging. \n\nhttps://plantix.net/en/library/plant-diseases/100107/grey-leaf-spot-of-maize",
    "treatments": null,
    "preventiveMeasures": "1. Plant resistant varieties if available in your area. \n2. Plant late to avoid adverse conditions for plants. \n3. Keep up good ventilation by widening the space between plants. \n4. Plow deep and bury all plant residues after harvest. \n5. Plan long-term crop rotations with non-host plants. \n\nhttps://plantix.net/en/library/plant-diseases/100107/grey-leaf-spot-of-maize"
  },
  {
    "label": "Corn_(maize)___Common_rust_",
    "readableName": "Corn (maize) with Common Rust",
    "symptoms": "Minute flecks appear on both sides of the leaves and slowly develop into small, tan, slightly raised spots. These mainly elongated spots later turn into powdery, golden-brown pustules loosely scattered in patches on upper and lower sides. The color can change to black as the plant matures. Contrarily to other rust diseases, symptoms are not usually present on other plant parts, such as stalks, sheath leaves or husks. However, stalks tend to grow weak and soft and are prone to lodging. Younger leaf tissue is more susceptible to fungal infection than mature leaves. Plants infected during the early stages can show chlorosis of leaves and death, leading to high yield losses if upper leaves are affected.\n\nhttps://plantix.net/en/library/plant-diseases/100082/common-rust-of-maize",
    "treatments": null,
    "preventiveMeasures": "The best management option is growing corn products with higher levels of tolerance to common rust. General plant tolerance reduces the number and size of pustules and the overall severity of infection.\n\nFungicides can effectively control common rust if initial applications are made while there are only a few pustules present per leaf. Use of fungicides is fairly common in sweet corn and seed corn production, but is rarely warranted in field corn because common rust rarely causes economically damaging yield loss in field corn. Scouting each corn field on a regular schedule will help determine if fungicide applications should be considered. If significant levels of common rust are present on the lower leaves prior to silking and cool, humid, or wet weather is likely to occur a fungicide application may be beneficial.\n\nhttps://www.dekalbasgrowdeltapine.com/en-us/agronomy/identifying-and-managing-common-rust-of-corn.html"
  },
  {
    "label": "Corn_(maize)___healthy",
    "readableName": "Healthy Corn (maize)",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Corn_(maize)___Northern_Leaf_Blight",
    "readableName": "Corn (maize) with Northern Leaf Blight",
    "symptoms": "Typical symptoms of northern corn leaf blight are canoe-shaped lesions 1 inch to 6 inches long. The lesions are initially bordered by gray-green margins. They eventually turn tan colored and may contain dark areas of fungal sporulation. The length or size of lesions may vary with in different corn hybrids reactions with different resistance genes. Lesions begin on the lower leaves and then spread to upper leaves. Severe symptoms can progress rapidly, resulting in blighted leaves. The disease can be confused with symptoms of Goss's leaf blight on some hybrids, and perhaps with Stewarts wilt where this disease occurs\n\nhttps://extension.umn.edu/corn-pest-management/northern-corn-leaf-blight",
    "treatments": null,
    "preventiveMeasures": "1. Planting resistant hybrids is the most effective method for controlling NCLB. Partial resistance protects against all four of the known races of the fungus and reduces the rate of disease development by reducing the number and size of the lesions and the amount of spores produced in these lesions, as well as increasing the length of the incubation and latent periods (time taken for new lesions to develop and produce a new crop of spores). Race-specific resistance protects against specific races of the fungus, reducing disease development by producing chlorotic lesion with limited and delayed sporulation. Partial resistant hybrids are the most common, but hybrids with both types of resistance are available. Resistant hybrids should be planted in all commercial dent corn production fields. Select hybrids with high levels of partial resistance in combination with Ht1, Ht2 or other Ht genes.\n2. A one- to two-year rotation away from corn and destruction of old corn residues by tillage will be helpful for controlling NCLB.\n3. Fungicide sprays are recommended for fresh market sweet corn, hybrid seed production, and dent corn fields planted with susceptible hybrids. The spray schedule should start when the first lesions appear on the leaf below the ear on 50% of the plants. Applications made at tasseling or silking (VT/R1) provide the most consistent results in terms of disease control and yield response. Several fungicides are available for use on corn for NCLB control. Read labels for rates and follow application directions which vary with each fungicide product\n\nhttps://ohioline.osu.edu/factsheet/plpath-cer-10"
  },
  {
    "label": "Grape___Black_rot",
    "readableName": "Grape with Black Rot",
    "symptoms": "Irregular spots appear on the leaves, which are framed by a dark line. Shoots, stems and leaf stalks can also show symptoms of these spots. If leaf stalks are affected the whole leaves will dry. Grapes will show grey discolorations in the first beginning, which then turn to reddish-brown or violet spots. The fruit will become deformed and eventually be shriveled and black mummified.\n\nhttps://plantix.net/en/library/plant-diseases/100350/black-rot-of-grape",
    "treatments": null,
    "preventiveMeasures": "- Choose a more resistant variety if available.\n- Remove fruit mummies from the vine.\n- Infested wood and twines should be removed and destroyed after harvest.\n- Consequently remove infested leaves from the vineyard.\n- Keep your vineyard clear of weeds.\n- Provide proper air circulation and lighting.\n- Prune your vines every year before the vegatative stage.\n\nhttps://plantix.net/en/library/plant-diseases/100350/black-rot-of-grape"
  },
  {
    "label": "Grape___Esca_(Black_Measles)",
    "readableName": "Grape with Esca (Black Measles)",
    "symptoms": "The disease may occur at any time during the growing season. The main symptom is an interveinal \"striping\" on the leaves, which is characterized by the discoloration and drying of the tissues around the main veins. It usually shows as dark red in red varieties and yellow in white ones. Leaves can dry out completely and drop prematurely. On berries, small, round, dark spots, often bordered by a brown-purple ring, may occur. These fruit spots may appear at any time between fruit set and ripening. In severely affected vines, the berries often crack and dry. Cross-sectional cuts through affected canes, spurs, cordons, or trunks reveal concentric rings formed by dark spots. A severe form of Esca known as \"apoplexy\" results in a sudden dieback of the entire vine.\n\nhttps://plantix.net/en/library/plant-diseases/100140/esca",
    "treatments": null,
    "preventiveMeasures": "Presently, there are no effective management strategies for measles. Wine grape growers with small vineyards will often have field crews remove infected fruit prior to harvest. Raisins affected by measles will be discarded during harvest or at the packing house, while table grape growers will leave affected fruit on the vine. Current research is focused on protecting pruning wounds from fungal infections to minimize suspect fungi from colonizing fresh wounds.\n\nhttps://grapes.extension.org/grapevine-measles/"
  },
  {
    "label": "Grape___healthy",
    "readableName": "Healthy Grape",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Grape___Leaf_blight_(Isariopsis_Leaf_Spot)",
    "readableName": "Grape with Leaf Blight (Isariopsis Leaf Spot)",
    "symptoms": "On leaf surface we will see lesions which are irregularly shaped (2 to 25 mm in diameter). Initially lesions are dull red to brown in color turn black later. If disease is severe this lesions may coalesce. On berries we can see symptom similar to black rot but the entire clusters will collapse.\n\nhttps://plantvillage.psu.edu/topics/grape/infos",
    "treatments": null,
    "preventiveMeasures": "Here are 11 tips for growing Grapes:\n1. Apply dormant sprays to reduce inoculum levels\n2. Cut it out\n3. Open up that canopy\n4. Don't let down your defenses\n5. Scout early, scout often\n6. Use protectant and systemic fungicides\n7. Consider fungicide resistance\n8. Watch the weather\n9. Spray well and wisely\n10. Apply, rain, repeat\n11. Organize your vines\n\nhttps://www.goodfruit.com/11-tips-to-beat-grape-fungal-diseases/"
  },
  {
    "label": "Orange___Haunglongbing_(Citrus_greening)",
    "readableName": "Orange with Haunglongbing (Citrus Greening)",
    "symptoms": "First symptom is usually the appearance of a yellow shoot on the tree, thereby one of the common name of the disease, huanglongbing (\"yellow dragon disease\"). Leaves progressively turn pale-yellow and display a diffuse blotchy mottling that may resemble zinc or manganese deficiency. A common way to tell these disorders apart is that the symptoms of these deficiencies tend to be symmetrical along the leaf vein, while those of the disease are asymmetrical. Chronically infected trees show stunted growth, premature defoliation and twig dieback. Trees may bear multiple off-season flowers that later fall off and small, irregular fruits with a thick, pale peel that remains green at the bottom.\n\nhttps://plantix.net/en/library/plant-diseases/300021/citrus-greening-disease",
    "treatments": null,
    "preventiveMeasures": "1. Plant resistant cultivars when available.\n2. Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation.\n3. Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation.\n4. Destroy all tomato and potato debris after harvest \n\nhttps://www.planetnatural.com/forums/topic/tomato-blight/"
  },
  {
    "label": "Peach___Bacterial_spot",
    "readableName": "Peach with Bacterial Spot",
    "symptoms": "Symptoms vary widely depending on the species of tree affected. Initially, small, water-soaked and grayish spots appear on the lower leaf side, most commonly near the tip or along the midrib. Over time, they become angular to irregular and purple, brown or black. Sometimes their centers become necrotic and fall out, leaving ragged \"shot-hole\". Severely infected leaves become chlorotic or scorched and may drop early, causing defoliation. Small, round, sunken spots form on the fruit, sometimes only on the side exposed to the sun. They are olive-brown to black and frequently surrounded by a water-soaked margin. As the fruit matures, they harden and in some cases, exude a yellowish gum after rainy periods. Opportunistic pathogens may colonize cracked or damaged fruit and cause them to rot. Pustules appear on twigs and later develop into cankers that release bacterial ooze.\n\nhttps://plantix.net/en/library/plant-diseases/300024/bacterial-spot-on-stone-fruits",
    "treatments": null,
    "preventiveMeasures": "Bacterial spot is a difficult disease to control when environmental conditions favor pathogen spread. As with all bacterial plant diseases, there are relatively few bactericide chemicals available for use. Compounds available for use on peach and nectarine for bacterial spot include copper, oxytetracycline (Mycoshield and generic equivalents), and syllit+captan; however, repeated applications are typically necessary for even minimal disease control.\n\nhttps://www.canr.msu.edu/news/management_of_bacterial_spot_on_peaches_and_nectarines"
  },
  {
    "label": "Peach___healthy",
    "readableName": "Healthy Peach",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Pepper,_bell___Bacterial_spot",
    "readableName": "Bell Pepper with Bacterial Spot",
    "symptoms": "Bacterial leaf spot causes lesions on the leaves that look as though they are soaked with water. These lesions normally begin on the lower leaves. As the disease progresses, it leaves a dark, purple-brown spot with a light brown center. Bacterial leaf spot on peppers causes spotting and raised cracks in the fruit. The cracks provide an opening for other disease pathogens. There are no pepper varieties that are reliably resistant to all of types of peppery leaf spot, but planting varieties that are resistant to some of the races may help prevent the disease. Insecticides containing copper are also useful in preventing the disease. In most cases, however, once the disease appears, copper isn't effective in treating pepper leaf spots. Use insecticides containing copper early in the season when you've had problems with the disease in previous years.\n\nhttps://www.gardeningknowhow.com/edible/vegetables/pepper/bacterial-leaf-spot-on-peppers.htm",
    "treatments": null,
    "preventiveMeasures": "Of course, once the symptoms of bacterial leaf spot begin to appear on your pepper plants, it's too late to save them. However, if you take precautions before planting next season, you'll have a better chance of preventing peppery leaf spot problems in the future. Crop rotation can help prevent bacterial leaf spot. Do not plant peppers or tomatoes in a location where either of these crops has been grown in the past four or five years. At the end of the season, remove all crop debris from the garden and destroy it. Do not compost plant debris that may contain the disease. Once the area is clean of all visible debris, till the soil or turn it with a shovel to bury any remaining bacteria. The bacterium is spread by splattering damp soil onto the leaves. Reduce the splatter by using a soaker hose and avoiding overhead watering. Stay out of the garden on wet days to avoid spreading disease on your hands and clothes. Bacterial leaf spot is also spread through infected seeds. Buy certified disease-free seeds and seedlings. It's best not to save your own seeds if you've ever had a problem with bacterial leaf spot on peppers.\n\nhttps://www.gardeningknowhow.com/edible/vegetables/pepper/bacterial-leaf-spot-on-peppers.htm"
  },
  {
    "label": "Pepper,_bell___healthy",
    "readableName": "Healthy Bell Pepper",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Potato___Early_blight",
    "readableName": "Potato with Early Blight",
    "symptoms": "Symptoms of early blight occur on older foliage, stem, and fruits. Gray to brown spots appear on leaves and gradually grow in a concentric manner around a clear center - the characteristic “bullseye” formation. These lesions are surrounded by a bright yellow halo. As the disease progresses, entire leaves may turn chlorotic and shed, leading to significant defoliation. When leaves die and fall, fruits become more vulnerable to sun scald. The same type of spots with a clear center appears on stems and fruits. The fruits begin to rot and may eventually fall off.\n\nhttps://plantix.net/en/library/plant-diseases/100321/early-blight",
    "treatments": "- Treatment of early blight includes prevention by planting potato varieties that are resistant to the disease; late maturing are more resistant than early maturing varieties. \n- Avoid overhead irrigation and allow for sufficient aeration between plants to allow the foliage to dry as quickly as possible. Practice a 2-year crop rotation. That is, do not replant potatoes or other crops in this family for 2 years after a potato crop has been harvested. \n- Keep the potato plants healthy and stress free by providing adequate nutrition and sufficient irrigation, especially later in the growing season after flowering when plants are most susceptible to the disease. \n- Only dig the tubers up when they are completely mature to prevent from damaging them. Any damage done at harvest can additionally facilitate the disease. \n- Remove plant debris and weed hosts at the end of the season to mitigate areas where the disease may overwinter.\n\nhttps://www.gardeningknowhow.com/edible/vegetables/potato/potato-early-blight-treatment.htm",
    "preventiveMeasures": null
  },
  {
    "label": "Potato___healthy",
    "readableName": "Healthy Potato",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Potato___Late_blight",
    "readableName": "Potato with Late Blight",
    "symptoms": "Found on tomato and potato plants, late blight is caused by the fungus Phytophthora infestans and is common throughout the United States. True to its name, the disease occurs later in the growing season with symptoms often not appearing until after blossom. Late blight first appears on the lower, older leaves as water-soaked, gray-green spots. As the disease matures, these spots darken and a white fungal growth forms on the undersides. Eventually the entire plant will become infected.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/late-blight/",
    "treatments": "1. Plant resistant cultivars when available.\n2. Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation.\n3. Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation.\n4. Destroy all tomato and potato debris after harvest\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/late-blight/",
    "preventiveMeasures": null
  },
  {
    "label": "Raspberry___healthy",
    "readableName": "Healthy Raspberry",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Soybean___healthy",
    "readableName": "Healthy Soybean",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Squash___Powdery_mildew",
    "readableName": "Squash with Powdery Mildew",
    "symptoms": "1. White patches of fungal growth develop on the lower surface of the leaf. Under favourable conditions, the patches enlarge and merge to cover the entire lower surface.\n2. Leaf edges curl upwards, exposing the white, powdery fungal growth (Fig. 1).\n3. Purple to reddish blotches may also develop on leaves.\n4. Tiny, round, black fungal structures (cleistothecia) may also be present on the underside of the leaves.\n\nhttps://www.daf.qld.gov.au/business-priorities/agriculture/plants/fruit-vegetable/diseases-disorders/powdery-mildew",
    "treatments": "- Apply sulfur or copper-based fungicides to prevent infection of susceptible plants. For best results, apply early or at first sign of disease. Spray all plant parts thoroughly and repeat at 7-10 day intervals up to the day of harvest.\n- Green Cure Fungicide contains a patented formula of potassium bicarbonate — commonly used in food products — that kills many plant diseases on contact and provides up to 2 weeks of residual protection. At first sign of disease, mix 1-2 Tbsp/ gallon of water and apply to all exposed surfaces of the plant. Monterey® BI-CARB is a similar product containing micro-encapsulated potassium bicarbonate as the active ingredient. Mix 4 tsps in 2 gallons of water to thoroughly cover foliage.\n- Effectively treat fungal diseases with SERENADE Garden. This broad spectrum bio-fungicide uses a patented strain of Bacillus subtilis that is approved for organic gardening. Best of all, it's safe to use — you can treat and pick crops the same day!\n- SNS 244 and Zero Tolerance Herbal Fungicide are made from 100% pure, food-grade ingredients that work fast to kill existing plant diseases and prevent new fungal problems from starting.\n- Indoor growers may want to consider using a Sulfur Burner/ Vaporizer which turns sulfur prills into a fine dust and changes the pH of leaf surfaces. Fungal spores and mold can't get established on this plant coating. As an added benefit, studies have shown that this dust will eliminate spider mites.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/powdery-mildew/",
    "preventiveMeasures": null
  },
  {
    "label": "Strawberry___healthy",
    "readableName": "Healthy Strawberry",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Strawberry___Leaf_scorch",
    "readableName": "Strawberry with Leaf Scorch",
    "symptoms": "Leaf scorch is caused by the fungus Diplocarpon earliana. Symptoms of leaf scorch consist of numerous small, irregular, purplish spots or “blotches” that develop on the upper surface of leaves. The centers of the blotches become brownish. Blotches may coalesce until they nearly cover the leaflet, which then appears purplish to reddish to brown.\n\nThe fungus overwinters on infected leaves. The fungus produces spore forming structures in the spring on both surfaces of dead leaves. These structures produce spores abundantly in midsummer. In the presence of free water, these spores can germinate and infect the plant within 24 hours. Older and middle-aged leaves are infected more easily than young ones.\n\nhttps://ohioline.osu.edu/factsheet/plpath-fru-35",
    "treatments": "- Remove the older and infected leaves from runner plants before setting.\n- Take care in spacing runner plants in matted-row culture.\n- Plant in light, well-drained soil in a location exposed to all-day sun and good air circulation.\n- Control weeds in the planting. Weeds reduce air circulation and increase drying time for leaves. (Leaves stay wet - longer in weedy plantings.)\n- Removing infected leaves after harvest (during renovation) is helpful in reducing inoculum and controlling all the leaf diseases\n\nhttps://ohioline.osu.edu/factsheet/plpath-fru-35",
    "preventiveMeasures": null
  },
  {
    "label": "Tomato___Bacterial_spot",
    "readableName": "Tomato with Bacterial spot",
    "symptoms": "Symptoms of bacterial spot appear as small, water-soaked, greasy spots on infected leaflets. On tomatoes, distinct spots with or without yellowing occur. Individual leaf spots may coalesce with each other, resulting in the browning of entire leaflets. Fruit spots often begin as dark specks with or without a white halo. As spots enlarge, they become raised and scab-like.\n\nhttps://www.growingproduce.com/vegetables/tactics-to-tackle-bacterial-spot-of-tomato/",
    "treatments": "Copper fungicides are the most commonly recommended treatment for bacterial leaf spot. Use copper fungicide as a preventive measure after you've planted your seeds but before you've moved the plants into their permanent homes. You can use copper fungicide spray before or after a rain, but don't treat with copper fungicide while it is raining. If you're seeing signs of bacterial leaf spot, spray with copper fungicide for a seven- to 10-day period, then spray again for one week after plants are moved into the field. Perform maintenance treatments every 10 days in dry weather and every five to seven days in rainy weather.\n\nhttps://www.gardeningchannel.com/tomato-diseases-how-to-fight-bacterial-spot/",
    "preventiveMeasures": null
  },
  {
    "label": "Tomato___Early_blight",
    "readableName": "Tomato with Early blight",
    "symptoms": "Common on tomato and potato plants, early blight is caused by the fungus Alternaria solani and occurs throughout the United States. Symptoms first appear on the lower, older leaves as small brown spots with concentric rings that form a “bull's eye” pattern. As the disease matures, it spreads outward on the leaf surface causing it to turn yellow, wither and die. Eventually the stem, fruit and upper portion of the plant will become infected. Crops can be severely damaged.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/early-blight/",
    "treatments": "1. Prune or stake plants to improve air circulation and reduce fungal problems.\n2. Make sure to disinfect your pruning shears (one part bleach to 4 parts water) after each cut.\n3. Keep the soil under plants clean and free of garden debris. Add a layer of organic compost to prevent the spores from splashing back up onto vegetation.\n4. Drip irrigation and soaker hoses can be used to help keep the foliage dry.\n5. For best control, apply copper-based fungicides early, two weeks before disease normally appears or when weather forecasts predict a long period of wet weather. Alternatively, begin treatment when disease first appears, and repeat every 7-10 days for as long as needed.\n6. Containing copper and pyrethrins, Bonide® Garden Dust is a safe, one-step control for many insect attacks and fungal problems. For best results, cover both the tops and undersides of leaves with a thin uniform film or dust. Depending on foliage density, 10 oz will cover 625 sq ft. Repeat applications every 7-10 days, as needed.\n7. SERENADE Garden is a broad spectrum, preventative bio-fungicide recommended for the control or suppression of many important plant diseases. For best results, treat prior to foliar disease development or at the first sign of infection. Repeat at 7-day intervals or as needed.\n8. Remove and destroy all garden debris after harvest and practice crop rotation the following year.\n9. Burn or bag infected plant parts. Do NOT compost.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/early-blight/",
    "preventiveMeasures": null
  },
  {
    "label": "Tomato___healthy",
    "readableName": "Healthy Tomato",
    "symptoms": null,
    "treatments": null,
    "preventiveMeasures": null
  },
  {
    "label": "Tomato___Late_blight",
    "readableName": "Tomato with Late Blight",
    "symptoms": "Brownish-green spots appear on the leaf margins and leaf tops. Later, large areas of the leaves turn brown completely. During wet weather, lesions on the lower side of the leaves may be covered with a gray to white moldy growth, making it easier to distinguish healthy from dead leaf tissue. As the disease progresses, the foliage runs brown, curls and dries. In some cases, the sharply delimited brown spots and the white covering also appear on the stems, branches, and petioles. Greyish-green to dirty-brown and wrinkled stains appear on the fruits. At these spots, the fruit flesh is hardened. \n\nhttps://plantix.net/en/library/plant-diseases/100046/tomato-late-blight",
    "treatments": "1. Plant resistant cultivars when available.\n2. Remove volunteers from the garden prior to planting and space plants far enough apart to allow for plenty of air circulation.\n3. Water in the early morning hours, or use soaker hoses, to give plants time to dry out during the day — avoid overhead irrigation.\n4. Destroy all tomato and potato debris after harvest \n\nhttps://www.planetnatural.com/forums/topic/tomato-blight/",
    "preventiveMeasures": null
  },
  {
    "label": "Tomato___Leaf_Mold",
    "readableName": "Tomato with Leaf Mold",
    "symptoms": "Symptoms commonly occur on both sides of the foliage and sometimes on fruit. Older leaves are infected first and then the disease slowly moves up towards young leaves. On the upper leaf surface, small, diffuse, pale green or yellowish spots with indefinite margins appear. On the underside, olive green to grayish purple and velvety patches develop below the leaf spots. These are composed of spore-producing structures and spore masses (conidia). Over time, as the spots enlarge, the color of the infected leaf changes from yellowish (chlorosis) to brown (necrosis) and the leaf begins to curl and dry. The leaves will drop prematurely, leading to defoliation in severe cases. Occasionally, this pathogen causes disease on the blossoms or fruits with various symptoms. The blossoms may turn black and will be killed before fruit set. Green and ripe fruits will develop smooth black irregular area on the stem end. As the disease progresses, the infected area becomes sunken, dry and leathery.\n\nhttps://plantix.net/en/library/plant-diseases/100257/leaf-mold-of-tomato",
    "treatments": "The pathogen P. fulfa can survive on infected plant debris or in the soil, although the initial source of the disease is often infected seed. The disease is spread by rain and wind, on tools and clothing, and via insect activity. High relative humidity (greater that 85%) combined with high temperatures encourages the spread of the disease. With that in mind, if growing tomatoes in a greenhouse, maintain night temps higher than outside temperatures. When planting, use only certified disease-free seed or treated seed. Remove and destroy all crop debris post-harvest. Sanitize the greenhouse between crop seasons. Use fans and avoid overhead watering to minimize leaf wetness. Also, stake and prune plants to increase ventilation. If the disease is detected, apply a fungicide according to the manufacturer's instructions at the first sign of infection.\n\nhttps://www.gardeningknowhow.com/edible/vegetables/tomato/managing-tomato-leaf-mold.htm",
    "preventiveMeasures": null
  },
  {
    "label": "Tomato___Septoria_leaf_spot",
    "readableName": "Tomato with Septoria Leaf Spot",
    "symptoms": "Symptoms are evident in the foliage, particularly older (lower) leaves. Septoria blight causes numerous small (about 1/8\" to 1/4\" in diameter) brown spots that develop light tan to white center as they age. Rapid defoliation occurs soon after if left untreated.The overall effect of both blights is similar. Leaves turn yellow, brown, then wither and die. Small black fruiting structures (pycnidia) can be seen in the center of the lesions after they have grown in size. \n\nhttps://hortnews.extension.iastate.edu/septoria-leaf-spot",
    "treatments": "1. Remove diseased leaves. If caught early, the lower infected leaves can be removed and burned or destroyed. However, removing leaves above where fruit has formed will weaken the plant and expose fruit to sunscald. At the end of the season, collect all foliage from infected plants and dispose of or bury. Do not compost diseased plants.\n\n2. Improve air circulation around the plants. If the plants can still be handled without breaking them, stake or cage the plants to raise them off the ground and promote faster drying of the foliage.\n\n3. Mulch around the base of the plants. Mulching will reduce splashing soil, which may contain fungal spores associated with debris. Apply mulch after the soil has warmed.\n\n4. Do not use overhead watering. Overhead watering facilitates infection and spreads the disease. Use a soaker hose at the base of the plant to keep the foliage dry. Water early in the day.\n\n5. Control weeds. Nightshade and horsenettle are frequently hosts of Septoria leaf spot and should be eradicated around the garden site.\n\n6. Use crop rotation. Next year do not plant tomatoes back in the same location where diseased tomatoes grew. Wait 1–2 years before replanting tomatoes in these areas.\n\n7. Use fungicidal sprays. If the above measures do not control the disease, you may want to use fungicidal sprays. Fungicides will not cure infected leaves, but they will protect new leaves from becoming infected. Apply at 7 to 10 day intervals throughout the season. Apply chlorothalonil, maneb, macozeb, or a copper-based fungicide, such as Bordeaux mixture, copper hydroxide, copper sulfate, or copper oxychloride sulfate. Follow harvest restrictions listed on the pesticide label.\n\nhttps://www.missouribotanicalgarden.org/gardens-gardening/your-garden/help-for-the-home-gardener/advice-tips-resources/pests-and-problems/diseases/fungal-spots/septoria-leaf-spot-of-tomato.aspx",
    "preventiveMeasures": null
  },
  {
    "label": "Tomato___Spider_mites Two-spotted_spider_mite",
    "readableName": "Tomato with Two-Spotted Spider Mite",
    "symptoms": "The tomato red spider mites are pale-orange to red and feed on the underside of leaves. They cannot be seen easily with the naked eye. Feeding damage caused by sucking sap appears as many shiny pale yellow marks on the top of the tomato leaf (see lower photo). Eventually the leaves turn brown and die or fall off. Severe attack leads to formation of webs on the plant (see photo). Red spider mites are difficult but not impossible to control.\n\nhttps://www.plantwise.org/knowledgebank/factsheetforfarmers/20137804187",
    "treatments": null,
    "preventiveMeasures": "Method I. Keeping Spider Mites Away.\n1. Plant your tomato plants where they stay warm without drying out.\n2. Ensure your tomato plants are growing in loamy soil with lots of organic matter.\n3. Place hot pepper or garlic in the soil to prevent spider mites.\n4. Apply diatomaceous earth to the soil around your tomato plants.\n5. Move your tomato plants indoors to protect them if you can.\n\nMethod II. Dettering Mites with Moisture\n1. Use black mulch to preserve soil moistures for your tomatoes.\n2. Soak your tomato plants every 7-10 days to prevent rot.\n3. Use a hose to remove spider mites from your plants.\n4. Keep a layer of water in your pot saucers to increase soil moisture.\n5. Install a humidifier close to your tomato plants to increase the moisture levels.\n\nMethod III. Controlling an Infestation\n1. Cut off and remove parts of your tomato plants that are infested.\n2. Spray insecticidal soap on tomato plants to kill spider mites.\n3. Apply horticultural oil to your tomato plants to eliminate spider mites.\n4. Use neem oil to control and prevent spider mites.\n\nhttps://www.wikihow.com/Prevent-Spider-Mites-on-Tomato-Plants"
  },
  {
    "label": "Tomato___Target_Spot",
    "readableName": "Tomato with Target Spot",
    "symptoms": "The disease starts on the older leaves and spreads upwards. The first signs are irregular-shaped spots (less than 1 mm) with a yellow margin. Some of the spots enlarge up to 10 mm and show characteristics rings, hence the name of  'target spot'. Spread to all leaflets and to other leaves is rapid, causing the leaves to turn yellow, collapse and die. Spots also occur on the stems. They are long and thin. Small light brown spots with dark margins may also occur on the fruit.\n\nhttps://apps.lucidcentral.org/pppw_v10/text/web_full/entities/tomato_target_spot_163.htm",
    "treatments": null,
    "preventiveMeasures": "Before planting:\n\n- Do not plant new crops next to older ones that have the disease.\n- Plant as far as possible from papaya, especially if leaves have small angular spots (Photo 5).\n- Check all seedlings in the nursery, and throw away any with leaf spots.\n\nDuring growth:\n\n- Remove a few branches from the lower part of the plants to allow better airflow at the base\n- Remove and burn the lower leaves as soon as the disease is seen, especially after the lower fruit trusses have been picked.\n- Keep plots free from weeds, as some may be hosts of the fungus.\n- Do not use overhead irrigation; otherwise, it will create conditions for spore production and infection.\n\nAfter harvest:\n\n- Collect and burn as much of the crop as possible when the harvest is complete.\n- Practise crop rotation, leaving 3 years before replanting tomato on the same land.\n\nhttps://apps.lucidcentral.org/pppw_v10/text/web_full/entities/tomato_target_spot_163.htm"
  },
  {
    "label": "Tomato___Tomato_mosaic_virus",
    "readableName": "Tomato with Mosaic Virus",
    "symptoms": "The typical symptoms of the mosaic virus include:\n- Yellow, white or green stripes/ streaks/ spots on foliage\n- Wrinkled, curled, or small leaves\n- Pronounced yellowing only of veins\n- Stunted growth and reduced yields\n- Infected fruit appears mottled and develops raised “warty” areas\n- dark green blisters\n- stems that dry out rapidly\n\nPlant viruses can be difficult to detect as these typical symptoms look similar to other plants with nutrient deficiencies and vary depending on the age of the plant when infection occurs. The virus movement can quickly spread to an entire leaf then the entire plant is taken over by the virus, and ultimately the infection will spread to other plants in the surrounding area.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/mosaic-virus/",
    "treatments": null,
    "preventiveMeasures": "Although the mosaic virus does not have a cure, follow these 10 tips to help you prevent it:\n\n1. Fungicides will NOT treat this viral disease.\n2. Plant resistant varieties when available or purchase transplants from a reputable source.\n3. Do NOT save seeds from infected crops.\n4. Spot treat with least-toxic, natural pest control products, such as Safer Soap, Bon-Neem, and diatomaceous earth, to reduce the number of disease-carrying insects.\n5. Harvest-Guard® row cover will help keep insect pests off vulnerable crops/ transplants and should be installed until bloom.\n6. Remove all perennial weeds, using least-toxic herbicides, within 100 yards of your garden plot.\n7. The virus can be spread through human activity, tools, and equipment. Frequently wash your hands and disinfect garden tools, stakes, ties, pots, greenhouse benches, etc. (one part bleach to 4 parts water) to reduce the risk of contamination.\n8. Avoid working in the garden during damp conditions (viruses are easily spread when plants are wet).\n9. Avoid using tobacco around susceptible plants. Cigarettes and other tobacco products may be infected and can spread the virus.\n10. Remove and destroy all infected plants. Do NOT compost.\n\nhttps://www.planetnatural.com/pest-problem-solver/plant-disease/mosaic-virus/"
  },
  {
    "label": "Tomato___Tomato_Yellow_Leaf_Curl_Virus",
    "readableName": "Tomato with Yellow Leaf Curl Virus",
    "symptoms": "Infection at seedling stage results in  severe stunting of young leaves and shoots, leading to a somewhat bushy growth of the plant. In older plants, the infection results in excessive branching, thicker and wrinkled leaves, and interveinal chlorosis clearly visible on the leaf blade. At later stages of the disease, the plants take a leathery texture and their chlorotic margins are rolled upwards and inwards. If the infection takes place before the flowering stage, the number of fruits is considerably reduced, even though there are no noticeable symptoms on their surface. \n\nhttps://plantix.net/en/library/plant-diseases/200036/tomato-yellow-leaf-curl-virus",
    "treatments": null,
    "preventiveMeasures": "- Use resistant or tolerant varieties. \n- Plant early to avoid peak populations of the whitefly. \n- Intercrop with rows of non-susceptible plants such as squash and cucumber. \n- Use nets to cover seedbeds and prevent whiteflies from  reaching plants. \n- Practice crop rotation with non-susceptible plants. \n- Avoid planting alternative host plants close to crops. \n- Mulch the seedbed or the field to break the life cycle of the whitefly. \n- Use sticky yellow plastic traps to mass-catch the insect. \n- Monitor the field, handpick diseased plants and bury them away from the field. \n- Find and eradicate weeds in and around the field. \n- Plow deep all plant debris after harvest or burn them. \n\nhttps://plantix.net/en/library/plant-diseases/200036/tomato-yellow-leaf-curl-virus"
  }
]